Show / Hide Table of Contents
Class LoadingULS
Loading ULS
Inheritance
System.Object
LoadingULS
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Concrete.Load
Assembly: IdeaRS.OpenModel.dll
Syntax
public class LoadingULS
Constructors
Improve this Doc   View Source
LoadingULS()
Constructor
Declaration
public LoadingULS()
Properties
Improve this Doc   View Source
InternalForces
Internal force in section (permanent for staged section)
Declaration
public ResultOfInternalForces InternalForces { get; set; }
Property Value
 Type |  Description
 ResultOfInternalForces
Improve this Doc   View Source
InternalForces2ndOrder
Internal forces of 2nd order effect
Declaration
public ResultOfInternalForces InternalForces2ndOrder { get; set; }
Property Value
 Type |  Description
 ResultOfInternalForces
Improve this Doc   View Source
InternalForcesBegin
Internal forces at the beginnig
Declaration
public ResultOfInternalForces InternalForcesBegin { get; set; }
Property Value
 Type |  Description
 ResultOfInternalForces
Improve this Doc   View Source
InternalForcesEnd
Internal forces at the end
Declaration
public ResultOfInternalForces InternalForcesEnd { get; set; }
Property Value
 Type |  Description
 ResultOfInternalForces
Improve this Doc   View Source
InternalForcesImperfection
Internal forces of imperfection effect
Declaration
public ResultOfInternalForces InternalForcesImperfection { get; set; }
Property Value
 Type |  Description
 ResultOfInternalForces
Improve this Doc   View Source
InternalForcesVariable
Variable internal force in staged section only
Declaration
public ResultOfInternalForces InternalForcesVariable { get; set; }
Property Value
 Type |  Description
 ResultOfInternalForces
 Improve this Doc
 View Source